# PostWarning Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..PostWarning Method
PerformanceAdviser Class See Also
---
Reports a problem detected during execution of a rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void PostWarning(
	FailureMessage message
)
```

Visual Basic
---
```text
Public Sub PostWarning ( _
	message As FailureMessage _
)
```

Visual C++
---
```text
public:
void PostWarning(
	FailureMessage^ message
)
```

# ### Parameters
message
    Type: Autodesk.Revit.DB..::..FailureMessage Warning describing the problem detected by a rule.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The message must have severity "warning". |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Performance advisor is not executing rules. |

# See Also
PerformanceAdviser Class
Autodesk.Revit.DB Namespace